
Процедура КнопкаВыполнитьНажатие(Кнопка)

КонецПроцедуры

&НаСервере
Процедура СформироватьШКНаСервере()
	Ном=Справочники.Номенклатура.Выбрать();
	Пока Ном.Следующий() Цикл
		Отбор=Новый структура ("Владелцы");
		Отбор.Владелец=Ном.Ссылка;
		Рег=РегистрыСведений.Штрихкоды.Выбрать(Отбор,);
		Если Рег.Следующий()=Ложь Тогда
			Если Ном.ЭтоГруппа=Ложь и Ном.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
				НовыйШК = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
				НовыйШК.Владелец = Ном.Ссылка;
				НовыйШК.Период = ТекущаяДата();
				НовыйШК.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN14");
				НовыйШК.ПредставлениеШтрихкода = " ";
				НовыйШК.Штрихкод = ПодключаемоеОборудованиеРТВызовСервера.СформироватьШтрихкод();
				НовыйШК.Записать(Истина);	
				Кол = Кол + 1;
				Сообщить(Строка(НовыйШК.Штрихкод) + " - " + Строка(НовыйШК.Владелец ));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Сообщить("Всего создано: " + Кол + " штрихкодов.");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШК(Команда)
	СформироватьШКНаСервере();
КонецПроцедуры
